In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv(r"C:\Users\Hp\OneDrive\Desktop\dsbdal codes\Social_Network_ads.csv")
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
from sklearn.preprocessing import LabelEncoder

In [5]:

le=LabelEncoder()
df['Gender'] = le.fit_transform(df['Gender'])
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510       1   19            19000          0
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0
3  15603246       0   27            57000          0
4  15804002       1   19            76000          0

In [7]:
df.isnull()

     User ID  Gender    Age  EstimatedSalary  Purchased
0      False   False  False            False      False
1      False   False  False            False      False
2      False   False  False            False      False
3      False   False  False            False      False
4      False   False  False            False      False
..       ...     ...    ...              ...        ...
395    False   False  False            False      False
396    False   False  False            False      False
397    False   False  False            False      False
398    False   False  False            False      False
399    False   False  False            False      False

[400 rows x 5 columns]

In [8]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [12]:
df.corr()

                  User ID    Gender       Age  EstimatedSalary  Purchased
User ID          1.000000 -0.025249 -0.000721         0.071097   0.007120
Gender          -0.025249  1.000000 -0.073741        -0.060435  -0.042469
Age             -0.000721 -0.073741  1.000000         0.155238   0.622454
EstimatedSalary  0.071097 -0.060435  0.155238         1.000000   0.362083
Purchased        0.007120 -0.042469  0.622454         0.362083   1.000000

In [13]:
x = df.loc[:,["Age","EstimatedSalary"]]
x

     Age  EstimatedSalary
0     19            19000
1     35            20000
2     26            43000
3     27            57000
4     19            76000
..   ...              ...
395   46            41000
396   51            23000
397   50            20000
398   36            33000
399   49            36000

[400 rows x 2 columns]

In [14]:
y = df["Purchased"]
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [17]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.2)

In [19]:
from sklearn.linear_model import LogisticRegression
logReg = LogisticRegression()

In [20]:
logReg.fit(x_train,y_train)
y_pred = logReg.predict(x_test)

In [22]:
from sklearn.metrics import accuracy_score,precision_score,recall_score,confusion_matrix

In [23]:
accuracy = accuracy_score(y_test,y_pred)
precision = precision_score(y_test,y_pred,average = 'micro')
recall = recall_score(y_test,y_pred,average='micro')

print("accuracy",accuracy)
print("precision",precision)
print("recall",recall)

accuracy 0.6375
precision 0.6375
recall 0.6375

In [24]:
cm = confusion_matrix(y_test,y_pred)
cm

array([[51,  0],
       [29,  0]], dtype=int64)

In [25]:
from sklearn.metrics import ConfusionMatrix
cmD = ConfusionMatrix(confusion_matrix = cm,display_labels =y.unique())
cmD.plot()

ImportError: cannot import name 'ConfusionMatrix' from 'sklearn.metrics' (C:\Users\Hp\anaconda3\Lib\site-packages\sklearn\metrics\__init__.py)